In [3]:
import sqlite3
import pandas as pd

con = sqlite3.connect('database.db')

In [5]:
query = '''
SELECT *
FROM Manufacturers
'''

pd.read_sql(sql=query, con=con)

   Code             Name
0     1             Sony
1     2    Creative Labs
2     3  Hewlett-Packard
3     4           Iomega
4     5          Fujitsu
5     6       Winchester